Apply again worked ok, fip deleted and then created:

```
➜  vpc_tf git:(master) ✗ tfa
ibm_resource_instance.logdna_instance: Refreshing state... [id=crn:v1:bluemix:public:logdna:us-south:a/713c783d9a507a53135fe6793c37cc74:e54eee2d-53ba-457c-b4b0-caf278309254::]
ibm_is_vpc.location: Refreshing state... [id=r006-ac0c46ee-3b1f-431e-b691-fef004bb5217]
ibm_is_security_group_rule.inbound_all_todo: Refreshing state... [id=r006-f1c8614a-850b-4939-8afe-cef7aa192b41.r006-0bf18e5f-0f0f-4682-94d0-c4e9f4994564]
ibm_is_security_group_rule.inbound_myip: Refreshing state... [id=r006-f1c8614a-850b-4939-8afe-cef7aa192b41.r006-c93c434f-8d9d-4bfd-b55e-26def63af528]
ibm_is_vpc_address_prefix.locations["1"]: Refreshing state... [id=r006-ac0c46ee-3b1f-431e-b691-fef004bb5217/r006-7f8053e3-d47b-41f2-be5d-faaa43566fe6]
ibm_is_vpc_address_prefix.locations["2"]: Refreshing state... [id=r006-ac0c46ee-3b1f-431e-b691-fef004bb5217/r006-c8aecaa3-e546-4e6f-89d6-305c43c3b837]
ibm_is_vpc_address_prefix.locations["0"]: Refreshing state... [id=r006-ac0c46ee-3b1f-431e-b691-fef004bb5217/r006-e0d33f49-46d9-424b-9814-0a746934e876]
ibm_resource_key.logdna: Refreshing state... [id=crn:v1:bluemix:public:logdna:us-south:a/713c783d9a507a53135fe6793c37cc74:e54eee2d-53ba-457c-b4b0-caf278309254:resource-key:f9e2d3f4-29ea-4812-a489-5ab369a9e9d5]
ibm_is_subnet.app["0"]: Refreshing state... [id=0717-3c3074d3-635e-41a3-8ffe-c7a98ee50c9a]
ibm_is_subnet.app["1"]: Refreshing state... [id=0727-effb9494-c588-4214-814e-b664810dd5c7]
ibm_is_subnet.data["0"]: Refreshing state... [id=0717-76b176ee-22d0-4a7f-ac24-7c52ebcc69f9]
ibm_is_subnet.data["1"]: Refreshing state... [id=0727-a12ef5a8-12a6-4d5b-b6d9-4d2b4e3d40ef]
ibm_is_instance.app["0"]: Refreshing state... [id=0717_3b08198d-b1be-47c4-9886-5d9425779fc0]
ibm_is_instance.app["1"]: Refreshing state... [id=0727_559a39a3-0aab-433a-8696-918f50f3c934]
ibm_is_floating_ip.location["1"]: Refreshing state... [id=r006-97728f0b-262e-4e47-94b6-3ba6cca76474]
ibm_is_floating_ip.location["0"]: Refreshing state... [id=r006-eca4c2b5-0e28-4e23-b692-83f0f60b0161]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # ibm_is_instance.app["1"] has been changed
  ~ resource "ibm_is_instance" "app" {
        id                      = "0727_559a39a3-0aab-433a-8696-918f50f3c934"
        name                    = "vpc3tier-app-1"
      ~ tags                    = [
          - "dir:_Users_pquiring_github.ibm.com_portfolio-solutions_scenario-3tier_vpc_tf",
          + "dir:_users_pquiring_github.ibm.com_portfolio-solutions_scenario-3tier_vpc_tf",
            # (1 unchanged element hidden)
        ]
        # (20 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }
  # ibm_is_instance.app["0"] has been changed
  ~ resource "ibm_is_instance" "app" {
        id                      = "0717_3b08198d-b1be-47c4-9886-5d9425779fc0"
        name                    = "vpc3tier-app-0"
      ~ tags                    = [
          - "dir:_Users_pquiring_github.ibm.com_portfolio-solutions_scenario-3tier_vpc_tf",
          + "dir:_users_pquiring_github.ibm.com_portfolio-solutions_scenario-3tier_vpc_tf",
            # (1 unchanged element hidden)
        ]
        # (20 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include actions to undo or respond to these changes.

──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # ibm_is_floating_ip.location["0"] must be replaced
-/+ resource "ibm_is_floating_ip" "location" {
      ~ address                 = "52.116.133.117" -> (known after apply)
      ~ id                      = "r006-eca4c2b5-0e28-4e23-b692-83f0f60b0161" -> (known after apply)
        name                    = "vpc3tier-app-0"
      ~ resource_controller_url = "https://cloud.ibm.com/vpc-ext/network/floatingIPs" -> (known after apply)
      ~ resource_crn            = "crn:v1:bluemix:public:is:us-south-1:a/713c783d9a507a53135fe6793c37cc74::floating-ip:r006-eca4c2b5-0e28-4e23-b692-83f0f60b0161" -> (known after apply)
      ~ resource_group_name     = "default" -> (known after apply)
      ~ resource_name           = "vpc3tier-app-0" -> (known after apply)
      ~ resource_status         = "available" -> (known after apply)
      ~ status                  = "available" -> (known after apply)
      ~ tags                    = [
          + "dir:_Users_pquiring_github.ibm.com_portfolio-solutions_scenario-3tier_vpc_tf",
          - "dir:_users_pquiring_github.ibm.com_portfolio-solutions_scenario-3tier_vpc_tf",
            # (1 unchanged element hidden)
        ]
      ~ target                  = "0717-cd40048c-9cb5-4d2d-9ad8-bc350c9cba2f" -> "0717-a932e4aa-03cb-4b27-965e-ffdecc0c196e" # forces replacement
      ~ zone                    = "us-south-1" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # ibm_is_floating_ip.location["1"] must be replaced
-/+ resource "ibm_is_floating_ip" "location" {
      ~ address                 = "52.116.200.116" -> (known after apply)
      ~ id                      = "r006-97728f0b-262e-4e47-94b6-3ba6cca76474" -> (known after apply)
        name                    = "vpc3tier-app-1"
      ~ resource_controller_url = "https://cloud.ibm.com/vpc-ext/network/floatingIPs" -> (known after apply)
      ~ resource_crn            = "crn:v1:bluemix:public:is:us-south-2:a/713c783d9a507a53135fe6793c37cc74::floating-ip:r006-97728f0b-262e-4e47-94b6-3ba6cca76474" -> (known after apply)
      ~ resource_group_name     = "default" -> (known after apply)
      ~ resource_name           = "vpc3tier-app-1" -> (known after apply)
      ~ resource_status         = "available" -> (known after apply)
      ~ status                  = "available" -> (known after apply)
      ~ tags                    = [
          + "dir:_Users_pquiring_github.ibm.com_portfolio-solutions_scenario-3tier_vpc_tf",
          - "dir:_users_pquiring_github.ibm.com_portfolio-solutions_scenario-3tier_vpc_tf",
            # (1 unchanged element hidden)
        ]
      ~ target                  = "0727-6edaedf5-388c-4284-bbd1-8e0f64f166a8" -> "0727-175648df-5eee-49f7-9e01-e735ff7f1f89" # forces replacement
      ~ zone                    = "us-south-2" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ instances = {
      ~ 0 = {
          ~ fip                  = "52.116.133.117" -> (known after apply)
          ~ primary_ipv4_address = "10.0.0.4" -> "10.0.0.5"
            # (1 unchanged element hidden)
        }
      ~ 1 = {
          ~ fip                  = "52.116.200.116" -> (known after apply)
          ~ primary_ipv4_address = "10.1.0.4" -> "10.1.0.5"
            # (1 unchanged element hidden)
        }
    }
ibm_is_floating_ip.location["1"]: Destroying... [id=r006-97728f0b-262e-4e47-94b6-3ba6cca76474]
ibm_is_floating_ip.location["0"]: Destroying... [id=r006-eca4c2b5-0e28-4e23-b692-83f0f60b0161]
ibm_is_floating_ip.location["1"]: Still destroying... [id=r006-97728f0b-262e-4e47-94b6-3ba6cca76474, 10s elapsed]
ibm_is_floating_ip.location["0"]: Still destroying... [id=r006-eca4c2b5-0e28-4e23-b692-83f0f60b0161, 10s elapsed]
ibm_is_floating_ip.location["0"]: Destruction complete after 12s
ibm_is_floating_ip.location["1"]: Destruction complete after 12s
ibm_is_floating_ip.location["1"]: Creating...
ibm_is_floating_ip.location["0"]: Creating...
ibm_is_floating_ip.location["1"]: Still creating... [10s elapsed]
ibm_is_floating_ip.location["0"]: Still creating... [10s elapsed]
ibm_is_floating_ip.location["1"]: Creation complete after 13s [id=r006-1c64be6c-2ae5-4d9b-a752-c509f9889671]
ibm_is_floating_ip.location["0"]: Creation complete after 14s [id=r006-a7982d32-512f-4b9c-a5e2-39225c611f95]

Apply complete! Resources: 2 added, 0 changed, 2 destroyed.
```